{
  "id": "gojek",
  "title": "Gojek / Moka",
  "intro": "Moka offers a point-of-sale application designed to simplify business operations for small and medium businesses. The company was bought by Gojek in 2020, a decacorn startup in South-East asia.",
  "projects": [
    {
      "id": "react_component_library",
      "menu": "React Component Library",
      "title": "React Component Library",
      "about": "Backoffice, or what we called our merchant’s dashboard was growing intensively and handled by more than 70 software engineers. In order to give it a structure, we need to standardize the elements building the Backoffice. To improve development experience and codebase structures, we need to have a component library as a single source of truth for the UI components of Backoffice. PIC of the project and development within the frontend team, and closely collaborating with the UI/UX team to implement the new design system."
    },
    {
      "id": "gofood_middleware",
      "menu": "GoFood middleware UI",
      "title": "GoFood middleware UI",
      "about": "After Moka was bought by Gojek, the plan to align moka users with GoFood apps became imminent. As each application runs on a different platform, this project was to create a middleware UI that allows Moka users to onboard the GoFood app. It was my first experience in developing an end-to-end cycle of an application."
    },
    {
      "id": "gostore",
      "menu": "GoStore",
      "title": "GoStore",
      "about": "In order for POS to stay relevant and become the central nervous system of merchants, POS needs to evolve into a commerce enablement platform and support both offline and online transactions. As a core member of GoStore Frontend, we developed the app from the build-up. The app allows each merchant to have their own digital store, e-commerce functionalities, SEO, payment, and data tracking. One of GoStore’s features is called Nationwide Shipping. Allowing users to ship logistics nationally across indonesia. PIC on frontend side, managed the projects requirements and cross-team functions with backend and QA team."
    },
    {
      "id": "pos_features",
      "menu": "POS Features",
      "title": "Mobile Item Library",
      "about": "Backoffice was initially designed for desktop view. However 18% of the users are using mobile to manage and create items, and using mobile view caused some incompatibilities that made the experience broken. Hence, we need to develop a responsive UI for mobile users.  Lead the development of the mobile version of the item library page. Implemented using new UI/UX design specifically for ease of mobile users, using media queries to handle responsive design for various mobile devices."
    },
    {
      "title": "Multi Layered Ingredient",
      "about": "Multi Layered Ingredients is a feature to improve the creation of ingredients and recipes for merchants. Previously, ingredients were defined only as one type, and this caused merchants to manually create new submissions to store more complex ingredients. Let’s say in creating a burger, a more complex ingredient, such as burger patty, consists of other ingredients too: meat and onion. Multi layered ingredient feature allows merchants to store ingredients in different steps: raw, semi-finished ingredients, and recipes. This allows users to have a more precise inventory handling and to view the real-time stock of items."
    },
    {
      "title": "Advanced Inventory",
      "about": "Heavy inventory handling improvements. Implemented various steps of approvals and different roles of employees to handle the complicated process when transferring the items/ingredients between numerous outlets of merchant's. Developed frontend features to display chronological history and notes of the transfer, handle the system to create full and partial transfer. Core involvement in frontend development plan and API structure discussions."
    },
    {
      "title": "Modifier Stock",
      "about": "Improving the existing modifier tracking system. Improve partner Hubster onboarding number."
    }
  ]
}
